; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite3 - satellite
	instrument10 - instrument
	instrument11 - instrument
	thermograph2 - mode
	thermograph0 - mode
	thermograph3 - mode
	image1 - mode
	Star1 - direction
	Star10 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation8 - direction
	Star6 - direction
	Star0 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star9 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation7)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 GroundStation8)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
	(supports instrument6 thermograph3)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 GroundStation8)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star0)
	(supports instrument8 image1)
	(supports instrument8 thermograph2)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 GroundStation7)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star11)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph0)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument10 thermograph0)
	(supports instrument10 thermograph2)
	(supports instrument10 image1)
	(calibration_target instrument10 Star9)
	(calibration_target instrument10 GroundStation5)
	(supports instrument11 image1)
	(supports instrument11 thermograph3)
	(calibration_target instrument11 Star11)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
)
(:goal (and
	(pointing satellite2 Star16)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph3)
	(have_image Planet14 image1)
	(have_image Planet15 thermograph3)
	(have_image Star16 thermograph0)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 6
2. (calibrate satellite2 instrument6 star11)
   added: (calibrated instrument6)
   goals met: 0 of 6
3. (turn_to satellite2 planet14 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet14)
   goals met: 0 of 6
4. (take_image satellite2 planet14 instrument6 image1)
   added: (have_image planet14 image1)
   goals met: 1 of 6
5. (turn_to satellite2 planet13 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet13)
   goals met: 1 of 6
6. (take_image satellite2 planet13 instrument6 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 2 of 6
7. (turn_to satellite2 planet12 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet12)
   goals met: 2 of 6
8. (take_image satellite2 planet12 instrument6 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 6
9. (turn_to satellite2 planet15 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet15)
   goals met: 3 of 6
10. (take_image satellite2 planet15 instrument6 thermograph3)
   added: (have_image planet15 thermograph3)
   goals met: 4 of 6
11. (turn_to satellite2 star16 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 star16)
   goals met: 5 of 6
12. (take_image satellite2 star16 instrument6 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 6 of 6
